# Функция Zip() применяется к набору итерируемых объектов, и возвращает итератор с кортежами из
# элементов входных данных.
# количество элементов в результате равно минимальному количеству элементов входного набора
# zip ([1, 2, 3], ['o', 'д', 'т'], ['f', 's', 't'])

# [(1, 'o', 'f'), (2, 'д', 's'), (3, 'т', 't')]
# нельзя пройтись дважды


# users = ['user1', 'user2', 'user3', 'user4', 'user5']
# ids = [4, 5, 9, 14, 7]
# data = zip(users, ids)
# print(data)                # вывод: <zip object at 0x0000019706013840>
# data = list(zip(users, ids))
# print(data)                # вывод: [('user1', 4), ('user2', 5), ('user3', 9), ('user4', 14), ('user5', 7)]

users = ['user1', 'user2', 'user3', 'user4', 'user5']
ids = [4, 5, 9, 14, 7]
solary = [111, 222, 333]
data = list(zip(users, ids, solary))
print(data)                 # вывод: [('user1', 4, 111), ('user2', 5, 222), ('user3', 9, 333)]
# особенность: zip проходит по минимальному набору элементов